<a href="https://colab.research.google.com/github/HwangHanJae/datascience-basic-tect/blob/main/pandas_10minutes_tutorial.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Pandas Tutorial
- 10 minutes to pandas

# 라이브러리 로드

In [1]:
import numpy as np
import pandas as pd

# 객체 생성

value의 리스트를 전달하여 Series 타입을 생성하고 pandas의 기본 인덱스를 적용합니다.

In [2]:
#Input
s = pd.Series([1,3,5, np.nan, 6,8])
#Output
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

datatime 타입과 레이블이있는 column과 Numpy array를 전달하여 Dataframe을 생성합니다.

In [3]:
dates = pd.date_range("20130101", periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [4]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list("ABCD"))
df

                   A         B         C         D
2013-01-01 -1.705505  0.344021  0.060566  0.125215
2013-01-02 -0.380216  1.056660 -1.814311  1.036786
2013-01-03  0.530525  0.873632  0.259123 -1.056844
2013-01-04  1.603470  0.065723 -0.939370  0.302146
2013-01-05 -0.085243  0.487316  0.379746 -0.716035
2013-01-06 -0.287761  0.375238  0.401569 -0.424635

Series 타입처럼 변환할수 있는 객체의 dict 타입을 전달하여 DataFrame을 생성합니다.

In [5]:
df2 = pd.DataFrame(
    {"A" : 1.0,
    "B" : pd.Timestamp("20130102"),
    "C" : pd.Series(1, index=list(range(4)), dtype="float32"),
    "D" : np.array([3] *4, dtype="int32"),
    "E" : pd.Categorical(["test","train","test","train"]),
    "F" : 'foo',}
)

df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

Dataframe의 columns 들은 다른 dtypes를 가지고 있습니다.

In [6]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

# 데이터 관찰

데이터 프레임의 상단, 하단을 보는 방법입니다.

In [7]:
df.head()

                   A         B         C         D
2013-01-01 -1.705505  0.344021  0.060566  0.125215
2013-01-02 -0.380216  1.056660 -1.814311  1.036786
2013-01-03  0.530525  0.873632  0.259123 -1.056844
2013-01-04  1.603470  0.065723 -0.939370  0.302146
2013-01-05 -0.085243  0.487316  0.379746 -0.716035

In [8]:
df.tail()

                   A         B         C         D
2013-01-02 -0.380216  1.056660 -1.814311  1.036786
2013-01-03  0.530525  0.873632  0.259123 -1.056844
2013-01-04  1.603470  0.065723 -0.939370  0.302146
2013-01-05 -0.085243  0.487316  0.379746 -0.716035
2013-01-06 -0.287761  0.375238  0.401569 -0.424635

index, columns를 표현합니다.

In [9]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [10]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

DataFrame.to_numpy()는 NumPy 표현을 제공합니다.

In [11]:
df

                   A         B         C         D
2013-01-01 -1.705505  0.344021  0.060566  0.125215
2013-01-02 -0.380216  1.056660 -1.814311  1.036786
2013-01-03  0.530525  0.873632  0.259123 -1.056844
2013-01-04  1.603470  0.065723 -0.939370  0.302146
2013-01-05 -0.085243  0.487316  0.379746 -0.716035
2013-01-06 -0.287761  0.375238  0.401569 -0.424635

In [12]:
df.to_numpy()

array([[-1.70550493,  0.34402112,  0.06056598,  0.12521482],
       [-0.38021595,  1.05666027, -1.81431057,  1.03678616],
       [ 0.53052533,  0.87363243,  0.25912321, -1.05684352],
       [ 1.60347032,  0.06572279, -0.93936982,  0.3021459 ],
       [-0.08524272,  0.48731558,  0.37974551, -0.71603491],
       [-0.28776116,  0.37523758,  0.40156887, -0.42463527]])

In [13]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [14]:
df2.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

DataFrame.to_numpy()는 index와 columns를 포함하지 않습니다.

Data를 T(transpose)합니다.

In [15]:
df

                   A         B         C         D
2013-01-01 -1.705505  0.344021  0.060566  0.125215
2013-01-02 -0.380216  1.056660 -1.814311  1.036786
2013-01-03  0.530525  0.873632  0.259123 -1.056844
2013-01-04  1.603470  0.065723 -0.939370  0.302146
2013-01-05 -0.085243  0.487316  0.379746 -0.716035
2013-01-06 -0.287761  0.375238  0.401569 -0.424635

In [16]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -1.705505   -0.380216    0.530525    1.603470   -0.085243   -0.287761
B    0.344021    1.056660    0.873632    0.065723    0.487316    0.375238
C    0.060566   -1.814311    0.259123   -0.939370    0.379746    0.401569
D    0.125215    1.036786   -1.056844    0.302146   -0.716035   -0.424635

axis=1(열)을 기준으로 정렬합니다.

In [17]:
df

                   A         B         C         D
2013-01-01 -1.705505  0.344021  0.060566  0.125215
2013-01-02 -0.380216  1.056660 -1.814311  1.036786
2013-01-03  0.530525  0.873632  0.259123 -1.056844
2013-01-04  1.603470  0.065723 -0.939370  0.302146
2013-01-05 -0.085243  0.487316  0.379746 -0.716035
2013-01-06 -0.287761  0.375238  0.401569 -0.424635

In [18]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01  0.125215  0.060566  0.344021 -1.705505
2013-01-02  1.036786 -1.814311  1.056660 -0.380216
2013-01-03 -1.056844  0.259123  0.873632  0.530525
2013-01-04  0.302146 -0.939370  0.065723  1.603470
2013-01-05 -0.716035  0.379746  0.487316 -0.085243
2013-01-06 -0.424635  0.401569  0.375238 -0.287761

values를 기준으로 정렬합니다.

기본적으로 오름차순이 적용됩니다. ascending = True

In [19]:
df.sort_values(by="B")

                   A         B         C         D
2013-01-04  1.603470  0.065723 -0.939370  0.302146
2013-01-01 -1.705505  0.344021  0.060566  0.125215
2013-01-06 -0.287761  0.375238  0.401569 -0.424635
2013-01-05 -0.085243  0.487316  0.379746 -0.716035
2013-01-03  0.530525  0.873632  0.259123 -1.056844
2013-01-02 -0.380216  1.056660 -1.814311  1.036786

# 가져오기

single column을 선택하면 Series 가 생성이 됩니다.

df.A와 기능이 동등합니다.

In [20]:
df["A"]

2013-01-01   -1.705505
2013-01-02   -0.380216
2013-01-03    0.530525
2013-01-04    1.603470
2013-01-05   -0.085243
2013-01-06   -0.287761
Freq: D, Name: A, dtype: float64

[]을 사용하면 행을 분할(슬라이싱) 합니다.

In [21]:
df[0:3]

                   A         B         C         D
2013-01-01 -1.705505  0.344021  0.060566  0.125215
2013-01-02 -0.380216  1.056660 -1.814311  1.036786
2013-01-03  0.530525  0.873632  0.259123 -1.056844

In [22]:
df["20130102":"20130104"]

                   A         B         C         D
2013-01-02 -0.380216  1.056660 -1.814311  1.036786
2013-01-03  0.530525  0.873632  0.259123 -1.056844
2013-01-04  1.603470  0.065723 -0.939370  0.302146

# 레이블별 선택

레이블을 사용하여 가져오기

In [23]:
df.loc[dates[0]]

A   -1.705505
B    0.344021
C    0.060566
D    0.125215
Name: 2013-01-01 00:00:00, dtype: float64

컬럼을 다중으로 선택하여 가져오기

In [24]:
df.loc[:, ["A", "B"]]

                   A         B
2013-01-01 -1.705505  0.344021
2013-01-02 -0.380216  1.056660
2013-01-03  0.530525  0.873632
2013-01-04  1.603470  0.065723
2013-01-05 -0.085243  0.487316
2013-01-06 -0.287761  0.375238

종료지점을 포함한 슬라이싱

In [25]:
df.loc["20130102" : "20130104", ["A","B"]]

                   A         B
2013-01-02 -0.380216  1.056660
2013-01-03  0.530525  0.873632
2013-01-04  1.603470  0.065723

객체가 반환하는 차원이 감소합니다.

In [26]:
df.loc["20130102", ["A","B"]]

A   -0.380216
B    1.056660
Name: 2013-01-02 00:00:00, dtype: float64

scalar 값을 가져옵니다

In [27]:
df.loc[dates[0], "A"]

-1.7055049295442992

scalar에 빠르게 엑세스하여 가져오는 방법입니다.

In [28]:
# df.at["20130101","A"]
df.at[dates[0],"A"]

-1.7055049295442992

# 위치(position)별로 선택

전달된 정수(integers)의 위치를 통해 다음을 선택

In [29]:
df.iloc[3]

A    1.603470
B    0.065723
C   -0.939370
D    0.302146
Name: 2013-01-04 00:00:00, dtype: float64

슬라이싱을 통해 Numpy/Python과 유사하게 작동합니다.

In [30]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04  1.603470  0.065723
2013-01-05 -0.085243  0.487316

정수 리스트를 통해 표현

In [31]:
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02 -0.380216 -1.814311
2013-01-03  0.530525  0.259123
2013-01-05 -0.085243  0.379746

row(행)만 슬라이싱을 합니다.

In [32]:
df.iloc[1:3, :]

                   A         B         C         D
2013-01-02 -0.380216  1.056660 -1.814311  1.036786
2013-01-03  0.530525  0.873632  0.259123 -1.056844

columns(열)만 슬라이싱 합니다.

In [33]:
df.iloc[:, 1:3]

                   B         C
2013-01-01  0.344021  0.060566
2013-01-02  1.056660 -1.814311
2013-01-03  0.873632  0.259123
2013-01-04  0.065723 -0.939370
2013-01-05  0.487316  0.379746
2013-01-06  0.375238  0.401569

value(값)로 가져옵니다.

In [34]:
df.iloc[1,1]

1.0566602671289416

scalar를 빠르게 엑세스하여 가져옵니다.

In [35]:
df.iat[1,1]

1.0566602671289416

#Boolean indexing

single column의 value를 통해 선택합니다.

In [36]:
df[df["A"]>0]

                   A         B         C         D
2013-01-03  0.530525  0.873632  0.259123 -1.056844
2013-01-04  1.603470  0.065723 -0.939370  0.302146

In [37]:
df

                   A         B         C         D
2013-01-01 -1.705505  0.344021  0.060566  0.125215
2013-01-02 -0.380216  1.056660 -1.814311  1.036786
2013-01-03  0.530525  0.873632  0.259123 -1.056844
2013-01-04  1.603470  0.065723 -0.939370  0.302146
2013-01-05 -0.085243  0.487316  0.379746 -0.716035
2013-01-06 -0.287761  0.375238  0.401569 -0.424635

In [38]:
df[df>0]

                   A         B         C         D
2013-01-01       NaN  0.344021  0.060566  0.125215
2013-01-02       NaN  1.056660       NaN  1.036786
2013-01-03  0.530525  0.873632  0.259123       NaN
2013-01-04  1.603470  0.065723       NaN  0.302146
2013-01-05       NaN  0.487316  0.379746       NaN
2013-01-06       NaN  0.375238  0.401569       NaN

isin() method를 통해 필터링

In [39]:
df2 = df.copy()
df2['E'] = ["one","one","two","three","four","three"]
df2

                   A         B         C         D      E
2013-01-01 -1.705505  0.344021  0.060566  0.125215    one
2013-01-02 -0.380216  1.056660 -1.814311  1.036786    one
2013-01-03  0.530525  0.873632  0.259123 -1.056844    two
2013-01-04  1.603470  0.065723 -0.939370  0.302146  three
2013-01-05 -0.085243  0.487316  0.379746 -0.716035   four
2013-01-06 -0.287761  0.375238  0.401569 -0.424635  three

In [40]:
df2[df2['E'].isin(["two","four"])]

                   A         B         C         D     E
2013-01-03  0.530525  0.873632  0.259123 -1.056844   two
2013-01-05 -0.085243  0.487316  0.379746 -0.716035  four

# Setting

새로운 column을 설정하면 index별로 데이터가 자동으로 정렬됩니다.

In [41]:
s1 = pd.Series([1,2,3,4,5,6], index=pd.date_range("20130102", periods=6))
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [42]:
df['F'] = s1

In [43]:
df

                   A         B         C         D    F
2013-01-01 -1.705505  0.344021  0.060566  0.125215  NaN
2013-01-02 -0.380216  1.056660 -1.814311  1.036786  1.0
2013-01-03  0.530525  0.873632  0.259123 -1.056844  2.0
2013-01-04  1.603470  0.065723 -0.939370  0.302146  3.0
2013-01-05 -0.085243  0.487316  0.379746 -0.716035  4.0
2013-01-06 -0.287761  0.375238  0.401569 -0.424635  5.0

label 별로 value를 설정합니다.

In [44]:
df.at[dates[0], "A"] = 0
df

                   A         B         C         D    F
2013-01-01  0.000000  0.344021  0.060566  0.125215  NaN
2013-01-02 -0.380216  1.056660 -1.814311  1.036786  1.0
2013-01-03  0.530525  0.873632  0.259123 -1.056844  2.0
2013-01-04  1.603470  0.065723 -0.939370  0.302146  3.0
2013-01-05 -0.085243  0.487316  0.379746 -0.716035  4.0
2013-01-06 -0.287761  0.375238  0.401569 -0.424635  5.0

position 별로 value를 설정합니다.

In [45]:
df.iat[0,1] = 0
df

                   A         B         C         D    F
2013-01-01  0.000000  0.000000  0.060566  0.125215  NaN
2013-01-02 -0.380216  1.056660 -1.814311  1.036786  1.0
2013-01-03  0.530525  0.873632  0.259123 -1.056844  2.0
2013-01-04  1.603470  0.065723 -0.939370  0.302146  3.0
2013-01-05 -0.085243  0.487316  0.379746 -0.716035  4.0
2013-01-06 -0.287761  0.375238  0.401569 -0.424635  5.0

NumPy array를 할당하여 설정합니다.

In [46]:
df.loc[:,"D"] = np.array([5] * len(df))
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000  0.060566  5  NaN
2013-01-02 -0.380216  1.056660 -1.814311  5  1.0
2013-01-03  0.530525  0.873632  0.259123  5  2.0
2013-01-04  1.603470  0.065723 -0.939370  5  3.0
2013-01-05 -0.085243  0.487316  0.379746  5  4.0
2013-01-06 -0.287761  0.375238  0.401569  5  5.0

In [47]:
df2 = df.copy()
df2[df2 > 0] = -df2
df2

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -0.060566 -5  NaN
2013-01-02 -0.380216 -1.056660 -1.814311 -5 -1.0
2013-01-03 -0.530525 -0.873632 -0.259123 -5 -2.0
2013-01-04 -1.603470 -0.065723 -0.939370 -5 -3.0
2013-01-05 -0.085243 -0.487316 -0.379746 -5 -4.0
2013-01-06 -0.287761 -0.375238 -0.401569 -5 -5.0

# 결측치

pandas는 주로  np.nan값을 누락 데이터를 나타내기 위하여 사용합니다.

In [48]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns)+["E"])
df1.loc[dates[0] : dates[1], "E"] = 1
df1

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000  0.060566  5  NaN  1.0
2013-01-02 -0.380216  1.056660 -1.814311  5  1.0  1.0
2013-01-03  0.530525  0.873632  0.259123  5  2.0  NaN
2013-01-04  1.603470  0.065723 -0.939370  5  3.0  NaN

how = 'any' 옵션을 사용하여 결측치를 가지고 있지 않는 데이터를 보여줍니다.

In [49]:
df1.dropna(how='any')

                   A        B         C  D    F    E
2013-01-02 -0.380216  1.05666 -1.814311  5  1.0  1.0

결측치를 채우기

In [50]:
df1.fillna(value=5)

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000  0.060566  5  5.0  1.0
2013-01-02 -0.380216  1.056660 -1.814311  5  1.0  1.0
2013-01-03  0.530525  0.873632  0.259123  5  2.0  5.0
2013-01-04  1.603470  0.065723 -0.939370  5  3.0  5.0

nan값을 가진 value를 boolean mask로 가져옵니다.

In [51]:
df1

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000  0.060566  5  NaN  1.0
2013-01-02 -0.380216  1.056660 -1.814311  5  1.0  1.0
2013-01-03  0.530525  0.873632  0.259123  5  2.0  NaN
2013-01-04  1.603470  0.065723 -0.939370  5  3.0  NaN

In [52]:
pd.isna(df1)

                A      B      C      D      F      E
2013-01-01  False  False  False  False   True  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False   True
2013-01-04  False  False  False  False  False   True

# Stats

In [53]:
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000  0.060566  5  NaN
2013-01-02 -0.380216  1.056660 -1.814311  5  1.0
2013-01-03  0.530525  0.873632  0.259123  5  2.0
2013-01-04  1.603470  0.065723 -0.939370  5  3.0
2013-01-05 -0.085243  0.487316  0.379746  5  4.0
2013-01-06 -0.287761  0.375238  0.401569  5  5.0

In [54]:
df.mean()

A    0.230129
B    0.476428
C   -0.275446
D    5.000000
F    3.000000
dtype: float64

In [55]:
df.mean(1)

2013-01-01    1.265141
2013-01-02    0.972427
2013-01-03    1.732656
2013-01-04    1.745965
2013-01-05    1.956364
2013-01-06    2.097809
Freq: D, dtype: float64

In [56]:
s = pd.Series([1,3,5,np.nan,6,8], index=dates).shift(2)
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

크기가 다르고 정렬이 필요한 객체로 작업합니다.

pandas는 지정된 차원을 따라 자동으로 broadcast합니다.

In [57]:
df.sub(s, axis='index')

                   A         B         C    D    F
2013-01-01       NaN       NaN       NaN  NaN  NaN
2013-01-02       NaN       NaN       NaN  NaN  NaN
2013-01-03 -0.469475 -0.126368 -0.740877  4.0  1.0
2013-01-04 -1.396530 -2.934277 -3.939370  2.0  0.0
2013-01-05 -5.085243 -4.512684 -4.620254  0.0 -1.0
2013-01-06       NaN       NaN       NaN  NaN  NaN

# Apply

In [58]:
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000  0.060566  5  NaN
2013-01-02 -0.380216  1.056660 -1.814311  5  1.0
2013-01-03  0.530525  0.873632  0.259123  5  2.0
2013-01-04  1.603470  0.065723 -0.939370  5  3.0
2013-01-05 -0.085243  0.487316  0.379746  5  4.0
2013-01-06 -0.287761  0.375238  0.401569  5  5.0

In [59]:
df.apply(np.cumsum)

                   A         B         C   D     F
2013-01-01  0.000000  0.000000  0.060566   5   NaN
2013-01-02 -0.380216  1.056660 -1.753745  10   1.0
2013-01-03  0.150309  1.930293 -1.494621  15   3.0
2013-01-04  1.753780  1.996015 -2.433991  20   6.0
2013-01-05  1.668537  2.483331 -2.054246  25  10.0
2013-01-06  1.380776  2.858569 -1.652677  30  15.0

In [60]:
df.apply(lambda x : x.max() - x.min())

A    1.983686
B    1.056660
C    2.215879
D    0.000000
F    4.000000
dtype: float64

# Histogramming

In [61]:
s = pd.Series(np.random.randint(0,7,size=10))
s

0    3
1    4
2    3
3    4
4    5
5    4
6    6
7    6
8    4
9    4
dtype: int64

In [62]:
s.value_counts()

4    5
6    2
3    2
5    1
dtype: int64

# String Methods

In [63]:
s = pd.Series(['A', "B","C","Aaba","Baca",np.nan,"CABA","dog","cat"])
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

# Merge(병합)

## Concat

pandas는 Series와 DataFrame 객체를 쉽게 결합할 수 있는 다양한 기능을 제공합니다.

Join, Merge 연산의 경우 index와 관계 대수를 위한 다양한 로직을 제공합니다.

In [64]:
df = pd.DataFrame(np.random.randn(10,4))
df

          0         1         2         3
0  0.585890  1.348289  2.878336 -0.038285
1 -1.772587 -0.719358  0.097381  1.591358
2  1.392328  1.261358  1.940786  0.241454
3 -0.646963 -0.714342 -1.873272  2.083037
4  0.948991 -0.580682 -0.136698 -0.795875
5  0.421108  2.255133  1.818840  0.442480
6 -1.658310 -1.097269 -0.026089 -0.790369
7  0.919021 -0.883683  2.231292 -0.018105
8  1.041088  0.249404 -0.100751  0.499232
9 -0.706575  0.392146  0.576631 -0.866076

In [65]:
pieces = [df[:3], df[3:7],df[7:]]
pieces

[          0         1         2         3
 0  0.585890  1.348289  2.878336 -0.038285
 1 -1.772587 -0.719358  0.097381  1.591358
 2  1.392328  1.261358  1.940786  0.241454,
           0         1         2         3
 3 -0.646963 -0.714342 -1.873272  2.083037
 4  0.948991 -0.580682 -0.136698 -0.795875
 5  0.421108  2.255133  1.818840  0.442480
 6 -1.658310 -1.097269 -0.026089 -0.790369,
           0         1         2         3
 7  0.919021 -0.883683  2.231292 -0.018105
 8  1.041088  0.249404 -0.100751  0.499232
 9 -0.706575  0.392146  0.576631 -0.866076]

In [66]:
pd.concat(pieces)

          0         1         2         3
0  0.585890  1.348289  2.878336 -0.038285
1 -1.772587 -0.719358  0.097381  1.591358
2  1.392328  1.261358  1.940786  0.241454
3 -0.646963 -0.714342 -1.873272  2.083037
4  0.948991 -0.580682 -0.136698 -0.795875
5  0.421108  2.255133  1.818840  0.442480
6 -1.658310 -1.097269 -0.026089 -0.790369
7  0.919021 -0.883683  2.231292 -0.018105
8  1.041088  0.249404 -0.100751  0.499232
9 -0.706575  0.392146  0.576631 -0.866076

## Join

SQL 스타일로 병합이 됩니다.

In [67]:
left = pd.DataFrame({"key" :["foo","foo"], "lval" : [1,2]})
left

   key  lval
0  foo     1
1  foo     2

In [68]:
right = pd.DataFrame({"key" :["foo","foo"], "lval" : [4,5]})
right

   key  lval
0  foo     4
1  foo     5

In [69]:
pd.merge(left, right, on='key')

   key  lval_x  lval_y
0  foo       1       4
1  foo       1       5
2  foo       2       4
3  foo       2       5

다른 예를 보자면

In [70]:
left = pd.DataFrame({"key" : ["foo","bar"], "lval" : [1,2]})
left

   key  lval
0  foo     1
1  bar     2

In [71]:
right = pd.DataFrame({"key" :["foo","bar"], "lval" : [4,5]})
right

   key  lval
0  foo     4
1  bar     5

In [72]:
pd.merge(left, right, on='key')

   key  lval_x  lval_y
0  foo       1       4
1  bar       2       5

# Grouping
'group by' 란 다음 단계 중 하나이상을 포함하는 프로세스를 의미합니다.
- 일부 기준에 따라 데이터를 그룹으로 나눕니다.
- 각 그룹에 독립적으로 기능을 적용합니다.
- 결과를 데이터 구조로 결합합니다.

In [73]:
df = pd.DataFrame(
    {
        "A" : ["foo",'bar','foo','bar','foo','bar','foo','foo'],
        "B" : ["one","one","two","three","two",'two','one','three'],
        "C" : np.random.randn(8),
        "D" : np.random.randn(8)
    }
)
df

     A      B         C         D
0  foo    one -0.028158 -0.324868
1  bar    one  1.579845  0.870258
2  foo    two  0.720957 -0.492648
3  bar  three  0.704751 -0.390651
4  foo    two -0.900153 -1.327566
5  bar    two -2.353203 -0.756701
6  foo    one  1.859950  1.162479
7  foo  three -0.345260  0.723498

그룹으로 결합후에 sum() 함수를 적용합니다.

In [74]:
df.groupby("A").sum()

            C         D
A
bar -0.068606 -0.277093
foo  1.307335 -0.259104

# Reshaping

## Stack

In [83]:
tuples = list(
    zip(
        *[
          ["bar","bar","baz","baz","foo","foo","qux","qux"],
          ["one","two","one","two","one","two","one",'two'],
        ]
    )
)

index = pd.MultiIndex.from_tuples(tuples, names=['first','second'])
df = pd.DataFrame(np.random.randn(8,2), index=index, columns=["A","B"])
df2 = df[:4]
df2

                     A         B
first second
bar   one     0.429916  1.070994
      two    -1.501776  0.414083
baz   one    -1.047855 -0.735037
      two    -1.804745  1.152013

stack() 메서드는 DataFrame 열의 수준을 압축합니다.

In [89]:
stacked = df2.stack()
stacked

first  second
bar    one     A    0.429916
               B    1.070994
       two     A   -1.501776
               B    0.414083
baz    one     A   -1.047855
               B   -0.735037
       two     A   -1.804745
               B    1.152013
dtype: float64

stacked DataFrame 이나 Series를 역 stack() 한 메서드는 unstack()입니다.

In [85]:
stacked.unstack()

                     A         B
first second
bar   one     0.429916  1.070994
      two    -1.501776  0.414083
baz   one    -1.047855 -0.735037
      two    -1.804745  1.152013

In [86]:
stacked.unstack(1)

second        one       two
first
bar   A  0.429916 -1.501776
      B  1.070994  0.414083
baz   A -1.047855 -1.804745
      B -0.735037  1.152013

In [87]:
stacked.unstack(0)

first          bar       baz
second
one    A  0.429916 -1.047855
       B  1.070994 -0.735037
two    A -1.501776 -1.804745
       B  0.414083  1.152013

## Pivot tables

In [90]:
df = pd.DataFrame(
    {
    "A" : ["one", "one","two","three"] * 3,
    "B" : ["A","B","C"] * 4,
    "C" : ["foo","foo","foo","bar","bar","bar"] * 2,
    "D" : np.random.randn(12),
    "E" : np.random.randn(12),
    }
)
df

        A  B    C         D         E
0     one  A  foo -0.075296  0.746180
1     one  B  foo -0.087607 -1.417424
2     two  C  foo -1.215462 -1.238508
3   three  A  bar -0.020355  1.387263
4     one  B  bar  1.915690  0.240728
5     one  C  bar  1.692274 -0.534873
6     two  A  foo -0.767189 -0.286277
7   three  B  foo -0.500972 -0.067474
8     one  C  foo  0.560399  0.048655
9     one  A  bar -0.456331 -0.123631
10    two  B  bar  0.157407 -1.772187
11  three  C  bar -0.100127 -2.030436

In [91]:
pd.pivot_table(df, values="D", index=["A","B"], columns=["C"])

C             bar       foo
A     B
one   A -0.456331 -0.075296
      B  1.915690 -0.087607
      C  1.692274  0.560399
three A -0.020355       NaN
      B       NaN -0.500972
      C -0.100127       NaN
two   A       NaN -0.767189
      B  0.157407       NaN
      C       NaN -1.215462